# Custom ფუნქცია არის ისეთი ფუნქცია,რომელსაც თავად პროგრამისტი ქმნის კონკრეტული ამოცანის შესასრულებლად.

# რატომ ვიყენებთ ფუნქციებს?
# 1) კოდის გამეორების თავიდან ასაცილებლად
# 2) კოდის გასამარტივებლად და გასაგებად
# 3) ერთი და იგივე ლოგიკის ბევრჯერ გამოსაყენებლად

# ფუნქციის შექმნის ეტაპები:
# 1) ვიყენებთ სიტყვას def
# 2) ვწერთ ფუნქციის სახელს
# 3) ფრჩხილებში ვწერთ პარამეტრებს (თუ აქვს)
# 4) ბოლოს ვწერთ ორწერტილს :
# 5) შიგნით, გადანაცვლებით (indentation), ვწერთ კოდს


print("_________1_________")

def sum(num1,num2):
    return num1 + num2

print(sum(9,10))

print("_________2_________")

def num(number):
    if number % 2 == 0:
        print("შენი რიცხვი ლუწია")
    else:
        print("შენი რიცხვი კენტია")

num(11)


print("_________3_________")

def k(num):
    return num ** 2

print(k(3))


print("_________4_________")

def word(text):
    return text.upper()

print(word("giorgi"))


print("_________5_________")

def word(name,second_name):
    return f"შენი სახელია {name} და გვარი {second_name}"

print(word("გიორგი","ბეჟაშვილი"))




