# 2
#  ფუნქცია არის კოდის ნაწილი , რომელსაც აქვს სახელი
# და ასრულებს კონკრეტულ მოქმედებას.
# ფუნქცია გვეხმარება, რომ ერთი და იგივე კოდი ბევრჯერ არ ვწეროთ
# და პროგრამა იყოს უფრო მარტივი და გასაგები.


# 3
#  print() არის ჩაშენებული ფუნქცია Python-ში.
# მისი დანიშნულებაა ტერმინალში  ინფორმაციის გამოტანა რაც იყო მითითებული არგუმენტად.


# 4
#  არგუმენტები არის მნიშვნელობები, რომლებსაც ფუნქციას გადავცემთ
# ფრჩხილებში (). მაგალითად print("Hello")-ში "Hello" არის არგუმენტი.


# 5
name = "გიორგი"
surname = "ბეჟაშვილი"
age = 16
profession = "დამწყები Python პროგრამისტი"
hobby = "პროგრამირება"
fav_language = "Python"
goal = "გავხდე პროფესიონალი პროგრამისტი"

cv = f"""
ჩემი სახელია {name} {surname}. მე ვარ {age} წლის.
მე ვარ {profession} და ჩემი მთავარი ჰობია {hobby}.
ჩემი საყვარელი პროგრამირების ენაა {fav_language},
და ჩემი მთავარი მიზანია {goal}.
მე ვარ მოტივირებული, პასუხისმგებლიანი და ყოველთვის მზად ვარ ახალი ცოდნის შესაძენად.
"""

print(cv)


