# FLOWCHART:
# პროცესი რომელიც ბლოკებად და ისრებით აჩვენებს რა ნაბიჯი შემდეგ რა ნაბიჯს მიჰყვება.

# SEQUENCING (ნაბიჯების რიგით შესრულება)

# ITERATION (LOOP — გამეორება)


# SELECTION (IF / ELSE — არჩევანი)


# PSEUDOCODE (პსევდოკოდი — ნახევრად კოდი, ნახევრად სიტყვები)





# ----------------------------------------------
# ტკბილი ყიყლიყოების  მომზადების ნაბიჯები
# ----------------------------------------------

# ინგრედიენტები:
# წყალი, ჟელატინი, შაქარი, სიროფი, მარილი, ვანილი, შაქრის პუდრი

# ----------------------------------------------
# ნაბიჯი 1 — ჟელატინის "დაბლომება"
# ტექნიკა: SEQUENCING (ნაბიჯები რიგით სრულდება)
# ----------------------------------------------

# ----------------------------------------------
# ნაბიჯი 2 — შაქრის სიროფის მომზადება
# ტექნიკა: SEQUENCING
# ----------------------------------------------

# ----------------------------------------------
# ნაბიჯი 3 — სიროფის ნელა გადაღება მიქსერში
# ტექნიკა: SELECTION (თუ ძალიან ცხელია → მოიცადე)
# ----------------------------------------------

# ----------------------------------------------
# ნაბიჯი 4 — ათქვეფა
# ტექნიკა: ITERATION (გათქვეფა გრძელდება სანამ არ გასქელდება)
# ----------------------------------------------

# ----------------------------------------------
# ნაბიჯი 5 — ვანილის დამატება
# ტექნიკა: Sequencing
# ----------------------------------------------

# ----------------------------------------------
# ნაბიჯი 6 — მასის ჩასხმა ფორმაში და შაქრის პუდრის მოყრა
# ტექნიკა: Sequencing
# ----------------------------------------------

# ----------------------------------------------
# ნაბიჯი 7 — 8 საათი გაშრობა
# ტექნიკა: ITERATION (დრო გადის)
# ----------------------------------------------

# ----------------------------------------------
# ნაბიჯი 8 — დაჭრა
# ტექნიკა: Sequencing
# ----------------------------------------------


# ----------------------------------------------
# საბოლოო შედეგი
# ----------------------------------------------




