
# 1

grade = int(input("შენიყვანე ნიშნი 0-100 :"))
if grade >= 90 and grade <= 100: 
    print("შენ ნიშანია A :")
else:
    if grade >= 80:
        print("შენ ნიშანია B")
    else:
        if grade >= 70:
            print("შენი ნაიშანია C")
        else:
            if grade >= 60:
                print("შენი ნიშანია D")
            else:
                if grade >= 0:
                    print ("შენი ნიშნია F")

# 2
num= int(input("შემოიყვანე რიცხვი:"))

if num < 0 :
    print("შენი რიცხვი უარყოფითია")

elif num == 0:
    print("შენი რიცხვი ნულია")
else: 
    if num > 0 :
        print("შნი რიცხვი დადებითია")


# 3
num1=int(input("ნებისმიერი პირველი რიცხვი :"))
num2=int(input("ნებისმიერი მეორე რიცხვი:"))

if num1 > num2 :
    print("პირველი რიცხვი მეტია მეორეზე")
else:
    if num1 <  num2 :
        print("პირველი რიცხვი ნაკლებია მეორეზე")
    

# 4
num = int(input("შეიყვანეთ რიცხვი: "))

if num % 2 == 0:
    print("რიცხვი ლუწია")
else:
    print("რიცხვი კენტია")

# 5

temp = float(input("Enter temperature in Celsius: "))

if temp<0:
    print( "Cold ❄️")
else:
    if temp <= 30:
        print("Normal 🌤️")
    else:
        print("Hot ☀️")


