# 2) 
# სია არის მონაცემთა ტიპი, რომელიც ინახავს რამდენიმე მნიშვნელობას ერთ ცვლადში.

numbers = [1, 2, 3, 4, 5]  
fruits = ["ვაშლი", "ბანანი", "მსხალი"] 

# 3) 
# ინდექსი არის ელემენტის მისამართი სიაში.

print(fruits[0]) 
print(fruits[1]) 


# 4) 
names = ["გიორგი", "ნიკა", "ლაშა", "დათო", "ანა", "მარი", "სოფო"]

names[1] = "ირაკლი"
names[5] = "თამარი"

print(names)


# 5)
mixed_list = ["ტექსტი", 25, 3.14, True, "Python", False, 100]


print(mixed_list[1])
print(mixed_list[3])
print(mixed_list[5])


# 6) 
age = 18
ages = [12, 15, 18, 21]

# ანუ:
# ცვლადი -> ერთი მნიშვნელობა
# ლისტი -> ბევრი მნიშვნელობა