// 1
// JavaScript- არის პროგრამირების ენა და იგი გამოიყენება საიტებისთვის ფუნქციონალის მიცემისთვის

// 2
// string - ტექსტური მონაცემი
// Number - რიცხვის მონაცემი
// boolean - ლოგიკური მნიშვნელობა
// Undefined - ცვლადი შექმნილია, მაგრამ მნიშვნელობა არ აქვს
// Null - ცარიელი მნიშვნელობა
// BigInt - ძალიან დიდი მთელი რიცხვები
// Symbol - უნიკალური მნიშვნელობა
// Object - ობიექტური მონაცემი

// 3
// Console - იგივენაირი ტერმინალი სადაც ვხედავთ შედეგს და შეცდომებს
// .log() - არის დამხმარე ხელსაწყო რომლითაც გამოგვაქვს კონსოლში 

console.log("number");
console.log(5);


// 4

let film = "Matrix"
let year = 1999
let rating = 8.7

console.log(`ფილმი ${film} გამოვიდა ${year} წელს და მისი რეიტინგია ${rating}`);

// 5

console.log(Math.round(Math.random()* 50))


